### CSV Connection

### read 시 한글깨짐 encoding = 'ms949'

In [1]:
import pandas as pd

In [2]:
test = pd.read_csv("../dataset/kopo_region_mst2.csv", encoding="ms949").head()
test

  REGIONID REGIONNAME
0      A00       아프리카
1      A01         미국
2      A02         한국
3      A03         독일
4      A04        브라질

In [3]:
test.to_csv("../dataset/test3.csv", encoding="ms949")

In [4]:
a=3
b=5

In [5]:
index="cj_love"
index[0:3]

'cj_'

In [6]:
testDict = dict(product="product1",qty="100")

In [7]:
testDict["qty"]

'100'

In [9]:
test = index.split("_")

In [10]:
print("{}, {}".format(b,a))

5, 3

In [1]:
# PANDAS 패키지 불러오기
import pandas as pd
 
# CSV 파일을 읽어 Data Frame 변수에 저장하기
customerData = pd.read_csv("../dataset/customerdata.csv")

# 컬럼해더 재정의
customerData.columns = ['CUSTID','AVGPRICE','EMI','DEVICECOUNT','PRODUCTAGE','CUSTTYPE']

# 데이터 VIEW
    
# CSV 파일로 저장
customerData.to_csv("../dataset/customerdata_out.csv", encoding='utf-8-sig', index=False)
customerData.head()

han = ['한글','한글','한글','한글','한글','한글','한글','한글','한글','한글','한글','한글','한글','한글','한글','한글','한글']

In [11]:
# CSV 파일로 저장
han = ['한글','한글','한글','한글','한글','한글','한글','한글','한글','한글','한글','한글','한글','한글','한글','한글','한글']
han_df = pd.DataFrame(han)
han_df.to_csv("../dataset/han.csv",  encoding='utf-8-sig', index=False)


#han = ['한글','한글','한글','한글','한글','한글','한글','한글','한글','한글','한글','한글','한글','한글','한글','한글','한글']

In [12]:
customerData = pd.read_csv("../dataset/han.csv")
customerData.head()

    0
0  한글
1  한글
2  한글
3  한글
4  한글

### Mysql connection

In [18]:
# PANDAS 패키지 불러오기
import pandas as pd 
import pymysql 
from sqlalchemy import create_engine 
 
# DB 커넥션 열기
mysql_engine = create_engine('mysql+pymysql://kopo:kopo1234@kopo2.cf0xvfbyuytw.us-east-1.rds.amazonaws.com:3306/kopo') 

# DB 테이블을 읽어 Data Frame 변수에 저장하기
storeData = pd.read_sql_query('SELECT * FROM store_location', mysql_engine) 
storeData.head()

                  cs_name         lng        lat
0  coffeekorea_seulleng93  127.047883  37.505675
1                 propose  126.899220  37.471711
2    singsingcoffee_toast  128.980455  35.159774
3            warawara_hof  127.061026  37.493922
4                    test  126.715710  37.460813

In [13]:
# 컬럼해더 재정의
storeData.columns = ['CS_NAME','LNG','LAT']

# 데이터 VIEW
print(storeData)

# 데이터 저장
resultname='mysqlresult'
storeData.to_sql(resultname, mysql_engine, if_exists='replace', index=False)

                  CS_NAME         LNG         LAT
0  coffeekorea_seulleng93  127.047883   37.505675
1                 propose  126.899220   37.471711
2    singsingcoffee_toast  128.980455   35.159774
3            warawara_hof  127.061026   37.493922
4                    test  126.715710   37.460813
5        polytech_kangseo   37.549506  126.840918
6       polytech_kangseo2  126.840918   37.549506

### Oracle connection

In [14]:
import pandas as pd
from sqlalchemy import create_engine 
 
# DB 커넥션 열기
engine = create_engine('oracle+cx_oracle://TEST1:TEST1@127.0.0.1:1521/xe') 

# DB 테이블을 읽어 Data Frame 변수에 저장하기
customerData = pd.read_sql_query('SELECT * FROM kopo_product_volume', engine) 

# 컬럼해더 재정의
customerData.columns = ['REGIONID','PRODUCT','YEARWEEK','VOLUME']

# 데이터 VIEW
customerData.head()

  REGIONID PRODUCT YEARWEEK    VOLUME
0      A01  ST0001   201415  810144.0
1      A01  ST0002   201415  128999.0
2      A01  ST0001   201418  671464.0
3      A01  ST0002   201418  134467.0
4      A01  ST0001   201413  470040.0

In [29]:
from sqlalchemy.dialects.oracle import VARCHAR2
# 데이터 저장
resultname='hk_result2'
customerData.to_sql(resultname, engine, if_exists='replace', index=False,
                   dtype={'REGIONID': VARCHAR2(256),
                         'PRODUCT': VARCHAR2(256),
                         'YEARWEEK': VARCHAR2(256)
                         })

In [31]:
from sqlalchemy import types 
# 데이터 저장
resultname='ora_result_hk'

to_varchar = {c:types.VARCHAR(customerData[c].str.len().max()) \
        for c in customerData.columns[customerData.dtypes == 'object'].tolist()}

customerData.to_sql(resultname, engine, if_exists='replace', index=False,
                   dtype=to_varchar)

### Postgresql Connection

In [32]:
import psycopg2
import pandas as pd
from sqlalchemy import create_engine 
 
# DB 커넥션 열기
engine = create_engine('postgresql://postgres:kopo@127.0.0.1:5432/postgres') 

# DB 테이블을 읽어 Data Frame 변수에 저장하기
selloutData = pd.read_sql_query('SELECT * FROM kopo_product_volume', engine) 

selloutData.head()

  regionid productgroup yearweek    volume
0      A01       ST0002   201512  151750.0
1      A01       ST0001   201520  645626.0
2      A01       ST0002   201520  125863.0
3      A01       ST0001   201515  810144.0
4      A01       ST0002   201515  128999.0

### MSSQL Connection

In [ ]:
# PANDAS 패키지 불러오기
import pandas as pd 
import pymssql 
from sqlalchemy import create_engine 
 
def executeQuery(sql_query):
    connection_string = 'mssql+pymssql://haiteam:kopo1234!@192.168.0.6:1433/kopo'
    engine = create_engine(connection_string)

    df = pd.read_sql(sql_query, engine)

    return df

# DB 테이블을 읽어 Data Frame 변수에 저장하기
storeData =executeQuery("select * from kopo_product_volume")
storeData.head()